#include <iostream>
using namespace std;
void main()
{
	setlocale(LC_ALL, "Rus");
	char answer1, answer2, answer3, answer4, answer5, answer6;
	int a = 0;
	int b = 0;
	cout << "\t\t\tАнкета пацiєнта з пiдозрою на COVID-19 при первинному медичному оглядi : \n" << endl;//Заполните анкету 
	cout << "\tГарячка: "<< "a) гарячка до 38°С, що добре контролюється прийомом жарознижуючих препаратiв;" << "\n"<<"\t\t"<<" b) гарячка вище 38°С, що не контролюється прийомом жарознижуючих препаратiв;"<<endl;
	cin >> answer1;
	if (answer1 == 'a')
	
		{
			a++;
		}
	else
	{
		b++;
	}
	
	cout << "\tКашель: " << " a) сухий кашель без задишки;" << "\n" << "\t\t" << " b) сухий кашель iз задишкою (SpO2>93%);" << endl;
	cin >> answer2;
	if (answer2 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tШлунково-кишковi розлади: " <<"\n" <<"\t\t a) вiдсутнiсть шлунково-кишкових розладiв (нудота, блювання, дiарея);" << "\n" << "\t\t" << " b) наявнiсть шлунково-кишкових розладiв (нудота, блювання та/або дiарея); " << endl;
	cin >> answer3;
	if (answer3 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tЗмiни свiдомостi: " << "\n" << "\t\t a) вiдсутнiсть змiн свiдомостi;" << "\n" << "\t\t" << " b) вiдсутнiсть порушення свiдомостi або млявiсть;" << "\n" << "\t\t c) порушення свiдомостi(дезорiєнтацiя, збудження, сплутанiсть, сопор);" <<endl;
	cin >> answer4;
	if (answer4 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tОзнаки пневмонiї: " << "\n" << "\t\t a) вiдсутнi клiнiчнi ознаки пневмонiї (фiзикальнi змiни в легенях);" << "\n" << "\t\t" << " b) наявнi клiнiчнi ознаки пневмонiї (фiзикальнi змiни в легенях);" << "\n" << endl;
	cin >> answer5;
	if (answer4 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tОзнаки пневмонiї: " << "\n" << "\t\t a) вiдсутнi рентгенологiчнi ознаки пневмонiї;" << "\n" << "\t\t" << " b) наявнi рентгенологiчнi ознаки пневмонiї;" << "\n" << endl;
	cin >> answer5;
	if (answer4 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tВiк пацiєнта: " << "\n" << "\t\t a) вiк до 65 рокiв;" << "\n" << "\t\t" << " b) вiк понад 65 рокiв;" << "\n" << endl;
	cin >> answer5;
	if (answer4 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
	cout << "\tВiк пацiєнта: " << "\n" << "\t\t a) пацiєнт не вiдноситься до групи ризику ;" << "\n" << "\t\t" << " b) пацієнт вiдноситься до групи ризику (наявність хоча б одного із захворювань):  " << "\n" << endl;
	cin >> answer6;
	if (answer6 == 'a')
	{
		a++;
	}
	else
	{
		b++;
	}
}